open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_usbserial_ch34x.c
/****************************************************************************
 * chips/bk7258/ap/bk7258_usbserial_ch34x.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * BK7258 board USB-host class for the CH340/CH341 asynchronous serial
 * protocol.  The class is deliberately limited to VID 0x1a86/PID 0x7523,
 * 115200 8N1, and no flow control.  It uses the standard NuttX USB host
 * registry and UART lower-half interfaces; it does not create a private
 * character-device ABI.
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <assert.h>
#include <errno.h>
#include <fcntl.h>
#include <poll.h>
#include <sched.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <string.h>
#include <syslog.h>
#include <unistd.h>

#include <debug.h>

#include <nuttx/clock.h>
#include <nuttx/fs/ioctl.h>
#include <nuttx/kthread.h>
#include <nuttx/mutex.h>
#include <nuttx/serial/serial.h>
#include <nuttx/signal.h>
#include <nuttx/spinlock.h>
#include <nuttx/usb/usb.h>
#include <nuttx/usb/usbhost.h>
#include <nuttx/wqueue.h>

#include <arch/chip/bk7258_usbserial_ch34x.h>

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#ifndef CONFIG_USBHOST
#  warning "CH34x USB serial class requires CONFIG_USBHOST"
#endif

#ifndef CONFIG_USBHOST_ASYNCH
#  error "CH34x USB serial class requires CONFIG_USBHOST_ASYNCH"
#endif

#ifndef CONFIG_SCHED_WORKQUEUE
#  warning "CH34x USB serial class requires CONFIG_SCHED_WORKQUEUE"
#endif

#ifndef CONFIG_SCHED_LPWORK
#  warning "CH34x USB serial class requires CONFIG_SCHED_LPWORK"
#endif

#ifndef CONFIG_SERIAL_REMOVABLE
#  warning "CH34x USB serial class requires CONFIG_SERIAL_REMOVABLE"
#endif

#define BK7258_CH34X_VID             0x1a86
#define BK7258_CH34X_PID             0x7523
#define BK7258_CH34X_DEVNAME         "/dev/ttyUSB0"

#define BK7258_CH34X_RXBUFSIZE       256
#define BK7258_CH34X_TXBUFSIZE       256
#define BK7258_CH34X_XFERDELAY       MSEC2TICK(10)

#define BK7258_CH34X_FOUND_IF        (1 << 0)
#define BK7258_CH34X_FOUND_IN        (1 << 1)
#define BK7258_CH34X_FOUND_OUT       (1 << 2)
#define BK7258_CH34X_FOUND_ALL       (BK7258_CH34X_FOUND_IF | \
                                      BK7258_CH34X_FOUND_IN | \
                                      BK7258_CH34X_FOUND_OUT)

/* CH341 vendor requests and register encodings.  These values follow the
 * public Linux kernel CH341 protocol reference:
 * https://github.com/torvalds/linux/blob/master/drivers/usb/serial/ch341.c
 * No Linux source is copied here; the USB transactions are implemented
 * against the NuttX USB host controller contract.
 */

#define BK7258_CH34X_REQ_READ_VERSION 0x5f
#define BK7258_CH34X_REQ_WRITE_REG    0x9a
#define BK7258_CH34X_REQ_SERIAL_INIT  0xa1
#define BK7258_CH34X_REQ_MODEM_CTRL   0xa4

#define BK7258_CH34X_REG_PRESCALER    0x12
#define BK7258_CH34X_REG_DIVISOR      0x13
#define BK7258_CH34X_REG_LCR          0x18
#define BK7258_CH34X_REG_LCR2         0x25
#define BK7258_CH34X_REG_FLOW_CTL     0x27

#define BK7258_CH34X_LCR_ENABLE_RX    0x80
#define BK7258_CH34X_LCR_ENABLE_TX    0x40
#define BK7258_CH34X_LCR_CS8          0x03
#define BK7258_CH34X_FLOW_NONE        0x00
#define BK7258_CH34X_BIT_RTS          (1 << 6)
#define BK7258_CH34X_BIT_DTR          (1 << 5)

#define BK7258_CH34X_CLKRATE          48000000u

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct bk7258_usbserial_ch34x_s
{
  /* Must be first: USB host casts usbhost_class_s to this private type. */

  struct usbhost_class_s usbclass;
  struct uart_dev_s      uartdev;
  mutex_t                lock;

  volatile bool          disconnected;
  bool                   registered;
  bool                   endpoints;
  bool                   rxena;
  bool                   txena;
  bool                   rx_active;
  bool                   rx_pending;
  bool                   rx_working;
  ssize_t                rx_result;
  uint8_t                rx_worker;
  uint8_t                version;
  uint8_t                lcr;
  uint8_t                mcr;
  uint16_t               pktsize;
  int16_t                crefs;

  struct work_s           rxwork;
  struct work_s           rxcompletework;
  struct work_s           txwork;
  struct work_s           destroywork;
  spinlock_t              rxlock;
  FAR uint8_t            *ctrlreq;
  FAR uint8_t            *ctrlbuf;
  FAR uint8_t            *inbuf;
  FAR uint8_t            *outbuf;
  usbhost_ep_t            bulkin;
  usbhost_ep_t            bulkout;

  char                    rxbuffer[BK7258_CH34X_RXBUFSIZE];
  char                    txbuffer[BK7258_CH34X_TXBUFSIZE];
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static FAR struct usbhost_class_s *bk7258_ch34x_create(
  FAR struct usbhost_hubport_s *hport,
  FAR const struct usbhost_id_s *id);
static int bk7258_ch34x_connect(FAR struct usbhost_class_s *usbclass,
  FAR const uint8_t *configdesc, int desclen);
static int bk7258_ch34x_disconnected(FAR struct usbhost_class_s *usbclass);
static void bk7258_ch34x_destroy(FAR void *arg);

static int bk7258_ch34x_setup(FAR struct uart_dev_s *uartdev);
static void bk7258_ch34x_shutdown(FAR struct uart_dev_s *uartdev);
static int bk7258_ch34x_attach(FAR struct uart_dev_s *uartdev);
static void bk7258_ch34x_detach(FAR struct uart_dev_s *uartdev);
static int bk7258_ch34x_ioctl(FAR struct file *filep, int cmd,
  unsigned long arg);
static void bk7258_ch34x_rxint(FAR struct uart_dev_s *uartdev, bool enable);
static bool bk7258_ch34x_rxavailable(FAR struct uart_dev_s *uartdev);
static void bk7258_ch34x_txint(FAR struct uart_dev_s *uartdev, bool enable);
static bool bk7258_ch34x_txready(FAR struct uart_dev_s *uartdev);
static bool bk7258_ch34x_txempty(FAR struct uart_dev_s *uartdev);

static int bk7258_ch34x_cfgdesc(
  FAR struct bk7258_usbserial_ch34x_s *priv,
  FAR const uint8_t *configdesc, int desclen);
static int bk7258_ch34x_alloc_buffers(
  FAR struct bk7258_usbserial_ch34x_s *priv);
static void bk7258_ch34x_free_buffers(
  FAR struct bk7258_usbserial_ch34x_s *priv);
static int bk7258_ch34x_ctrlout(
  FAR struct bk7258_usbserial_ch34x_s *priv, uint8_t req,
  uint16_t value, uint16_t index);
static int bk7258_ch34x_ctrlin(
  FAR struct bk7258_usbserial_ch34x_s *priv, uint8_t req,
  uint16_t value, uint16_t index, uint16_t len);
static int bk7258_ch34x_write_reg(
  FAR struct bk7258_usbserial_ch34x_s *priv, uint8_t reg1,
  uint8_t reg2, uint16_t value);
static int bk7258_ch34x_set_baud_lcr(
  FAR struct bk7258_usbserial_ch34x_s *priv);
static int bk7258_ch34x_configure(
  FAR struct bk7258_usbserial_ch34x_s *priv);

