open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_usbserial_ch34x.c
static void bk7258_ch34x_rxwork(FAR void *arg);
static void bk7258_ch34x_rxcompletework(FAR void *arg);
static void bk7258_ch34x_rxcallback(FAR void *arg, ssize_t nread);
static void bk7258_ch34x_rxwork_common(
  FAR struct bk7258_usbserial_ch34x_s *priv, uint8_t slot);
static void bk7258_ch34x_txwork(FAR void *arg);
#ifdef CONFIG_BK7258_USBHOST_CH34X_VALIDATION
static int bk7258_ch34x_validation_thread(int argc, FAR char *argv[]);
#endif

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct usbhost_id_s g_bk7258_ch34x_id[1] =
{
  {
    USB_CLASS_VENDOR_SPEC,
    0,
    0,
    BK7258_CH34X_VID,
    BK7258_CH34X_PID
  }
};

static struct usbhost_registry_s g_bk7258_ch34x_registry =
{
  NULL,
  bk7258_ch34x_create,
  1,
  g_bk7258_ch34x_id
};

static const struct uart_ops_s g_bk7258_ch34x_uart_ops =
{
  .setup       = bk7258_ch34x_setup,
  .shutdown    = bk7258_ch34x_shutdown,
  .attach      = bk7258_ch34x_attach,
  .detach      = bk7258_ch34x_detach,
  .ioctl       = bk7258_ch34x_ioctl,
  .receive     = NULL,
  .rxint       = bk7258_ch34x_rxint,
  .rxavailable = bk7258_ch34x_rxavailable,
#ifdef CONFIG_SERIAL_IFLOWCONTROL
  .rxflowcontrol = NULL,
#endif
  .send        = NULL,
  .txint       = bk7258_ch34x_txint,
  .txready     = bk7258_ch34x_txready,
  .txempty     = bk7258_ch34x_txempty,
  .release     = NULL,
  .recvbuf     = NULL,
  .sendbuf     = NULL
};

/* One statically owned instance is intentional.  USB host create() may run
 * from a context where heap allocation is not safe, while this board
 * contract exposes only one fixed /dev/ttyUSB0 endpoint. */

static struct bk7258_usbserial_ch34x_s g_bk7258_ch34x;
static spinlock_t g_bk7258_ch34x_alloc_lock = SP_UNLOCKED;
static bool g_bk7258_ch34x_inuse;
static mutex_t g_bk7258_ch34x_registry_lock = NXMUTEX_INITIALIZER;
static bool g_bk7258_ch34x_registered;

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static inline uint16_t bk7258_ch34x_getle16(FAR const uint8_t *p)
{
  return (uint16_t)p[0] | (uint16_t)p[1] << 8;
}

static inline void bk7258_ch34x_putle16(FAR uint8_t *p, uint16_t value)
{
  p[0] = value & 0xff;
  p[1] = value >> 8;
}

static inline int bk7258_ch34x_usbret(int ret)
{
  /* NuttX HCD APIs return zero/non-negative transfer lengths or negative
   * errno.  A positive control result cannot describe a successful zero
   * length control transaction and is treated as an I/O error. */

  return ret > 0 ? -EIO : ret;
}

static FAR struct bk7258_usbserial_ch34x_s *
bk7258_ch34x_from_uart(FAR struct uart_dev_s *uartdev)
{
  DEBUGASSERT(uartdev != NULL && uartdev->priv != NULL);
  return (FAR struct bk7258_usbserial_ch34x_s *)uartdev->priv;
}

static int bk7258_ch34x_queue_rx_slot(
  FAR struct bk7258_usbserial_ch34x_s *priv, uint8_t slot, clock_t delay)
{
  FAR struct work_s *work;
  worker_t worker;
  irqstate_t flags;
  bool enabled;
  int ret;

  if (slot == 0)
    {
      work = &priv->rxwork;
      worker = bk7258_ch34x_rxwork;
    }
  else
    {
      work = &priv->rxcompletework;
      worker = bk7258_ch34x_rxcompletework;
    }

  flags = spin_lock_irqsave(&priv->rxlock);
  enabled = priv->rxena && !priv->disconnected;
  spin_unlock_irqrestore(&priv->rxlock, flags);
  if (!enabled || !work_available(work))
    {
      return -EBUSY;
    }

  ret = work_queue(LPWORK, work, worker, priv, delay);
  return ret;
}

static void bk7258_ch34x_queue_rx(
  FAR struct bk7258_usbserial_ch34x_s *priv, clock_t delay)
{
  irqstate_t flags;
  bool idle;
  uint8_t slot;

  flags = spin_lock_irqsave(&priv->rxlock);
  idle = priv->rxena && !priv->disconnected && !priv->rx_active &&
         !priv->rx_working;
  slot = priv->rx_pending ? (priv->rx_worker == 0 ? 1 : 0) : 0;
  spin_unlock_irqrestore(&priv->rxlock, flags);

  if (idle)
    {
      (void)bk7258_ch34x_queue_rx_slot(priv, slot, delay);
    }
}

static void bk7258_ch34x_queue_tx(
  FAR struct bk7258_usbserial_ch34x_s *priv, clock_t delay)
{
  int ret;

  if (!priv->txena || priv->disconnected || !work_available(&priv->txwork))
    {
      return;
    }

  ret = work_queue(LPWORK, &priv->txwork, bk7258_ch34x_txwork, priv, delay);
  if (ret < 0 && ret != -EBUSY)
    {
      uerr("CH34x TX work_queue failed: %d\n", ret);
    }
}

static int bk7258_ch34x_ctrlout(
  FAR struct bk7258_usbserial_ch34x_s *priv, uint8_t req,
  uint16_t value, uint16_t index)
{
  FAR struct usb_ctrlreq_s *ctrlreq;
  FAR struct usbhost_hubport_s *hport = priv->usbclass.hport;

  DEBUGASSERT(priv->ctrlreq != NULL && hport != NULL);
  ctrlreq = (FAR struct usb_ctrlreq_s *)priv->ctrlreq;
  ctrlreq->type = USB_DIR_OUT | USB_REQ_TYPE_VENDOR |
                  USB_REQ_RECIPIENT_DEVICE;
  ctrlreq->req = req;
  bk7258_ch34x_putle16(ctrlreq->value, value);
  bk7258_ch34x_putle16(ctrlreq->index, index);
  bk7258_ch34x_putle16(ctrlreq->len, 0);

  return bk7258_ch34x_usbret(
    DRVR_CTRLOUT(hport->drvr, hport->ep0, ctrlreq, NULL));
}

static int bk7258_ch34x_ctrlin(
  FAR struct bk7258_usbserial_ch34x_s *priv, uint8_t req,
  uint16_t value, uint16_t index, uint16_t len)
{
  FAR struct usb_ctrlreq_s *ctrlreq;
  FAR struct usbhost_hubport_s *hport = priv->usbclass.hport;

  DEBUGASSERT(priv->ctrlreq != NULL && priv->ctrlbuf != NULL && hport != NULL);
  ctrlreq = (FAR struct usb_ctrlreq_s *)priv->ctrlreq;
  ctrlreq->type = USB_DIR_IN | USB_REQ_TYPE_VENDOR |
                  USB_REQ_RECIPIENT_DEVICE;
  ctrlreq->req = req;
  bk7258_ch34x_putle16(ctrlreq->value, value);
  bk7258_ch34x_putle16(ctrlreq->index, index);
  bk7258_ch34x_putle16(ctrlreq->len, len);

  return bk7258_ch34x_usbret(
    DRVR_CTRLIN(hport->drvr, hport->ep0, ctrlreq, priv->ctrlbuf));
}

static int bk7258_ch34x_write_reg(
  FAR struct bk7258_usbserial_ch34x_s *priv, uint8_t reg1,
  uint8_t reg2, uint16_t value)
{
  return bk7258_ch34x_ctrlout(priv, BK7258_CH34X_REQ_WRITE_REG,
                              (uint16_t)reg2 << 8 | reg1, value);
}

static int bk7258_ch34x_set_baud_lcr(
  FAR struct bk7258_usbserial_ch34x_s *priv)
{
  unsigned int divisor;
  int ret;

  /* This wrapper promises 115200 only.  The CH341 divisor formula is kept
   * explicit so the transaction cannot silently program a nearby rate. */

  divisor = BK7258_CH34X_CLKRATE / (4 * 115200);
  divisor /= 2;
  if (divisor < 2 || divisor > 255)
    {
      return -ERANGE;
    }

