open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_usbserial_ch34x.c
  divisor = (0x100 - divisor) << 8 | 3;
  if (priv->version > 0x27)
    {
      divisor |= 1 << 7;
    }

  ret = bk7258_ch34x_write_reg(priv, BK7258_CH34X_REG_PRESCALER,
                               BK7258_CH34X_REG_DIVISOR, divisor);
  if (ret < 0)
    {
      return ret;
    }

  /* CH341 versions before 0x30 use the reset-default 8N1 line format and
   * expose separate legacy registers.  Version 0x30+ accepts the combined
   * LCR/LCR2 write used here. */

  if (priv->version >= 0x30)
    {
      ret = bk7258_ch34x_write_reg(priv, BK7258_CH34X_REG_LCR,
                                   BK7258_CH34X_REG_LCR2, priv->lcr);
    }

  return ret;
}

static int bk7258_ch34x_configure(
  FAR struct bk7258_usbserial_ch34x_s *priv)
{
  int ret;

  ret = bk7258_ch34x_ctrlin(priv, BK7258_CH34X_REQ_READ_VERSION, 0, 0, 2);
  if (ret < 0)
    {
      return ret;
    }

  priv->version = priv->ctrlbuf[0];

  ret = bk7258_ch34x_ctrlout(priv, BK7258_CH34X_REQ_SERIAL_INIT, 0, 0);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_ch34x_set_baud_lcr(priv);
  if (ret < 0)
    {
      return ret;
    }

  /* No software/hardware flow control.  The public CH341 transaction uses
   * both bytes of the flow-control register and zero as the value. */

  ret = bk7258_ch34x_write_reg(priv, BK7258_CH34X_REG_FLOW_CTL,
                               BK7258_CH34X_REG_FLOW_CTL,
                               BK7258_CH34X_FLOW_NONE << 8 |
                               BK7258_CH34X_FLOW_NONE);
  if (ret < 0)
    {
      return ret;
    }

  /* Assert DTR and RTS.  The CH341 modem-control request takes the
   * complement of the asserted bit mask, as documented by the reference
   * protocol implementation. */

  return bk7258_ch34x_ctrlout(priv, BK7258_CH34X_REQ_MODEM_CTRL,
                              (uint16_t)~priv->mcr, 0);
}

static int bk7258_ch34x_cfgdesc(
  FAR struct bk7258_usbserial_ch34x_s *priv,
  FAR const uint8_t *configdesc, int desclen)
{
  FAR struct usbhost_hubport_s *hport = priv->usbclass.hport;
  struct usbhost_epdesc_s bindesc;
  struct usbhost_epdesc_s boutdesc;
  uint8_t found = 0;
  bool in_interface = false;
  int remaining;
  int ret;

  memset(&bindesc, 0, sizeof(bindesc));
  memset(&boutdesc, 0, sizeof(boutdesc));
  if (desclen < USB_SIZEOF_CFGDESC ||
      ((FAR const struct usb_desc_s *)configdesc)->type !=
      USB_DESC_TYPE_CONFIG)
    {
      return -EINVAL;
    }

  remaining = bk7258_ch34x_getle16(configdesc + 2);
  if (remaining < USB_SIZEOF_CFGDESC || remaining > desclen)
    {
      return -EINVAL;
    }

  {
    uint8_t cfglen = configdesc[0];
    if (cfglen < USB_SIZEOF_CFGDESC || cfglen > remaining)
      {
        return -EINVAL;
      }

    configdesc += cfglen;
    remaining -= cfglen;
  }
  while (remaining >= (int)sizeof(struct usb_desc_s))
    {
      FAR const struct usb_desc_s *desc =
        (FAR const struct usb_desc_s *)configdesc;

      if (desc->len < sizeof(struct usb_desc_s) || desc->len > remaining)
        {
          return -EINVAL;
        }

      if (desc->type == USB_DESC_TYPE_INTERFACE &&
          desc->len >= USB_SIZEOF_IFDESC)
        {
          FAR const struct usb_ifdesc_s *ifdesc =
            (FAR const struct usb_ifdesc_s *)configdesc;
          in_interface = ifdesc->classid == USB_CLASS_VENDOR_SPEC &&
                         (found & BK7258_CH34X_FOUND_IF) == 0;
          if (in_interface)
            {
              found |= BK7258_CH34X_FOUND_IF;
            }
        }
      else if (desc->type == USB_DESC_TYPE_ENDPOINT && in_interface &&
               desc->len >= USB_SIZEOF_EPDESC)
        {
          FAR const struct usb_epdesc_s *epdesc =
            (FAR const struct usb_epdesc_s *)configdesc;
          uint16_t mps = bk7258_ch34x_getle16(epdesc->mxpacketsize);

          if ((epdesc->attr & USB_EP_ATTR_XFERTYPE_MASK) ==
              USB_EP_ATTR_XFER_BULK && mps != 0)
            {
              if (USB_ISEPIN(epdesc->addr))
                {
                  if ((found & BK7258_CH34X_FOUND_IN) != 0)
                    {
                      return -EINVAL;
                    }

                  found |= BK7258_CH34X_FOUND_IN;
                  bindesc.hport = hport;
                  bindesc.addr = epdesc->addr & USB_EP_ADDR_NUMBER_MASK;
                  bindesc.in = true;
                  bindesc.xfrtype = USB_EP_ATTR_XFER_BULK;
                  bindesc.interval = epdesc->interval;
                  bindesc.mxpacketsize = mps;
                }
              else
                {
                  if ((found & BK7258_CH34X_FOUND_OUT) != 0)
                    {
                      return -EINVAL;
                    }

                  found |= BK7258_CH34X_FOUND_OUT;
                  boutdesc.hport = hport;
                  boutdesc.addr = epdesc->addr & USB_EP_ADDR_NUMBER_MASK;
                  boutdesc.in = false;
                  boutdesc.xfrtype = USB_EP_ATTR_XFER_BULK;
                  boutdesc.interval = epdesc->interval;
                  boutdesc.mxpacketsize = mps;
                }
            }
        }

      configdesc += desc->len;
      remaining -= desc->len;
    }

  if (found != BK7258_CH34X_FOUND_ALL)
    {
      return -EINVAL;
    }

  ret = DRVR_EPALLOC(hport->drvr, &boutdesc, &priv->bulkout);
  if (ret < 0)
    {
      return bk7258_ch34x_usbret(ret);
    }

  ret = DRVR_EPALLOC(hport->drvr, &bindesc, &priv->bulkin);
  if (ret < 0)
    {
      DRVR_EPFREE(hport->drvr, priv->bulkout);
      priv->bulkout = NULL;
      return bk7258_ch34x_usbret(ret);
    }

  priv->endpoints = true;
  priv->pktsize = bindesc.mxpacketsize;
  if (boutdesc.mxpacketsize < priv->pktsize)
    {
      priv->pktsize = boutdesc.mxpacketsize;
    }

  return OK;
}

static int bk7258_ch34x_alloc_buffers(
  FAR struct bk7258_usbserial_ch34x_s *priv)
{
  FAR struct usbhost_hubport_s *hport = priv->usbclass.hport;
  size_t maxlen;
  int ret;

  ret = DRVR_ALLOC(hport->drvr, &priv->ctrlreq, &maxlen);
  if (ret < 0 || maxlen < sizeof(struct usb_ctrlreq_s))
    {
      ret = ret < 0 ? bk7258_ch34x_usbret(ret) : -ENOMEM;
      goto errout;
    }

  ret = DRVR_IOALLOC(hport->drvr, &priv->ctrlbuf, 2);
  if (ret < 0)
    {
      ret = bk7258_ch34x_usbret(ret);
      goto errout;
    }

  ret = DRVR_IOALLOC(hport->drvr, &priv->inbuf, priv->pktsize);
  if (ret < 0)
    {
      ret = bk7258_ch34x_usbret(ret);
      goto errout;
    }

  ret = DRVR_IOALLOC(hport->drvr, &priv->outbuf, priv->pktsize);
  if (ret < 0)
    {
      ret = bk7258_ch34x_usbret(ret);
      goto errout;
    }

  return OK;

errout:
  bk7258_ch34x_free_buffers(priv);
  return ret;
}

