open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_usbserial_ch34x.c
static void bk7258_ch34x_free_buffers(
  FAR struct bk7258_usbserial_ch34x_s *priv)
{
  FAR struct usbhost_hubport_s *hport = priv->usbclass.hport;

  if (priv->outbuf != NULL)
    {
      DRVR_IOFREE(hport->drvr, priv->outbuf);
      priv->outbuf = NULL;
    }

  if (priv->inbuf != NULL)
    {
      DRVR_IOFREE(hport->drvr, priv->inbuf);
      priv->inbuf = NULL;
    }

  if (priv->ctrlbuf != NULL)
    {
      DRVR_IOFREE(hport->drvr, priv->ctrlbuf);
      priv->ctrlbuf = NULL;
    }

  if (priv->ctrlreq != NULL)
    {
      DRVR_FREE(hport->drvr, priv->ctrlreq);
      priv->ctrlreq = NULL;
    }
}

static void bk7258_ch34x_rxcallback(FAR void *arg, ssize_t nread)
{
  FAR struct bk7258_usbserial_ch34x_s *priv = arg;
  irqstate_t flags;
  uint8_t slot;
  bool queue;
  clock_t delay;

  /* The HCD may invoke this callback from interrupt context.  In
   * particular, do not touch the UART ring or wait for a worker here.  The
   * callback is also the point at which ownership of inbuf returns from the
   * HCD to this class. */

  flags = spin_lock_irqsave(&priv->rxlock);
  if (!priv->rx_active)
    {
      spin_unlock_irqrestore(&priv->rxlock, flags);
      return;
    }

  priv->rx_active = false;
  priv->rx_pending = true;
  priv->rx_result = nread;
  slot = priv->rx_worker == 0 ? 1 : 0;
  queue = priv->rxena && !priv->disconnected && nread != -ESHUTDOWN &&
          nread != -ENODEV;
  delay = nread == -EAGAIN ? BK7258_CH34X_XFERDELAY : 0;
  spin_unlock_irqrestore(&priv->rxlock, flags);

  if (queue)
    {
      /* The alternate item is normally free because the completion callback
       * runs after the submitting worker returned.  If an unusual HCD calls
       * back inline, the submitting item is the safe fallback once that
       * worker has returned; retaining rx_pending lets a later enable retry
       * if both items are temporarily busy. */

      if (bk7258_ch34x_queue_rx_slot(priv, slot, delay) == -EBUSY)
        {
          (void)bk7258_ch34x_queue_rx_slot(priv,
                                           slot == 0 ? 1 : 0, delay);
        }
    }
}

static void bk7258_ch34x_rxwork_common(
  FAR struct bk7258_usbserial_ch34x_s *priv, uint8_t slot)
{
  FAR struct usbhost_hubport_s *hport;
  FAR struct uart_dev_s *uartdev;
  irqstate_t flags;
  ssize_t nread = 0;
  size_t ndx;
  size_t copied = 0;
  bool have_result;
  bool retry;
  int ret;

  DEBUGASSERT(priv != NULL);

  /* Mark the worker before inspecting the state.  This closes the race in
   * which a repeated RX enable queues the other work item while this one is
   * consuming the previous completion. */

  flags = spin_lock_irqsave(&priv->rxlock);
  if (priv->rx_working)
    {
      spin_unlock_irqrestore(&priv->rxlock, flags);
      return;
    }

  priv->rx_working = true;
  if (!priv->rxena || priv->disconnected)
    {
      priv->rx_pending = false;
      priv->rx_working = false;
      spin_unlock_irqrestore(&priv->rxlock, flags);
      return;
    }

  have_result = priv->rx_pending;
  if (have_result)
    {
      nread = priv->rx_result;
      priv->rx_pending = false;
    }
  spin_unlock_irqrestore(&priv->rxlock, flags);

  hport = priv->usbclass.hport;
  uartdev = &priv->uartdev;
  if (hport == NULL || priv->bulkin == NULL || priv->inbuf == NULL)
    {
      flags = spin_lock_irqsave(&priv->rxlock);
      priv->rx_working = false;
      spin_unlock_irqrestore(&priv->rxlock, flags);
      return;
    }

  if (have_result)
    {
      if (nread > priv->pktsize)
        {
          uerr("CH34x RX over-length transfer: %d\n", (int)nread);
          nread = -EIO;
        }

      if (nread > 0)
        {
          flags = uart_spinlock(uartdev, false);
          for (ndx = 0; ndx < (size_t)nread; ndx++)
            {
              unsigned int next = uartdev->recv.head + 1;
              if (next >= (unsigned int)uartdev->recv.size)
                {
                  next = 0;
                }

              if (next == (unsigned int)uartdev->recv.tail)
                {
                  break;
                }

              uartdev->recv.buffer[uartdev->recv.head] = priv->inbuf[ndx];
              uartdev->recv.head = next;
              copied++;
            }
          uart_spinunlock(uartdev, false, flags);
          if (copied != 0)
            {
              uart_datareceived(uartdev);
            }
        }
      else if (nread < 0 && nread != -EAGAIN && nread != -ESHUTDOWN &&
               nread != -ENODEV && !priv->disconnected)
        {
          uerr("CH34x RX transfer failed: %d\n", (int)nread);
        }
    }

  /* Reserve the shared DMA buffer before calling the HCD.  There can be at
   * most one asynchronous IN request, and no worker may reuse inbuf while it
   * is owned by that request. */

  flags = spin_lock_irqsave(&priv->rxlock);
  if (!priv->rxena || priv->disconnected || priv->rx_active ||
      priv->rx_pending)
    {
      priv->rx_working = false;
      spin_unlock_irqrestore(&priv->rxlock, flags);
      return;
    }

  priv->rx_worker = slot;
  priv->rx_active = true;
  spin_unlock_irqrestore(&priv->rxlock, flags);

  ret = DRVR_ASYNCH(hport->drvr, priv->bulkin, priv->inbuf, priv->pktsize,
                    bk7258_ch34x_rxcallback, priv);
  if (ret > 0)
    {
      /* The standard asynchronous contract returns zero or a negative
       * errno.  Do not leave rx_active latched if a non-conforming HCD
       * reports a transfer length here. */

      ret = -EIO;
    }

  flags = spin_lock_irqsave(&priv->rxlock);
  if (ret < 0)
    {
      priv->rx_active = false;
    }
  retry = ret < 0 && priv->rxena && !priv->disconnected;
  priv->rx_working = false;
  spin_unlock_irqrestore(&priv->rxlock, flags);

  if (ret < 0 && retry && ret != -ESHUTDOWN && ret != -ENODEV)
    {
      (void)bk7258_ch34x_queue_rx_slot(priv, slot == 0 ? 1 : 0,
                                       BK7258_CH34X_XFERDELAY);
    }
}

static void bk7258_ch34x_rxwork(FAR void *arg)
{
  bk7258_ch34x_rxwork_common(arg, 0);
}

static void bk7258_ch34x_rxcompletework(FAR void *arg)
{
  bk7258_ch34x_rxwork_common(arg, 1);
}

static void bk7258_ch34x_txwork(FAR void *arg)
{
  FAR struct bk7258_usbserial_ch34x_s *priv = arg;
  FAR struct usbhost_hubport_s *hport;
  FAR struct uart_dev_s *uartdev;
  irqstate_t flags;
  unsigned int starttail;
  unsigned int count = 0;
  unsigned int ndx;
  ssize_t nwritten;

  DEBUGASSERT(priv != NULL);
  hport = priv->usbclass.hport;
  uartdev = &priv->uartdev;
  if (!priv->txena || priv->disconnected || hport == NULL ||
      priv->bulkout == NULL)
    {
      return;
    }

  /* Copy without advancing tail.  If a short transfer occurs, bytes remain
   * queued and are retried in their original order. */

  flags = uart_spinlock(uartdev, false);
  starttail = uartdev->xmit.tail;
  ndx = starttail;
  while (ndx != (unsigned int)uartdev->xmit.head && count < priv->pktsize)
    {
      priv->outbuf[count++] = uartdev->xmit.buffer[ndx];
      if (++ndx >= (unsigned int)uartdev->xmit.size)
        {
          ndx = 0;
        }
    }
  uart_spinunlock(uartdev, false, flags);

  if (count != 0)
    {
      nwritten = DRVR_TRANSFER(hport->drvr, priv->bulkout, priv->outbuf,
                               count);
      if (nwritten > (ssize_t)count)
        {
          nwritten = -EIO;
        }

      if (nwritten > 0)
        {
          flags = uart_spinlock(uartdev, false);
          /* No other worker advances tail, so this remains the start of the
           * packet.  The upper half may only have changed head meanwhile. */
          uartdev->xmit.tail = starttail;
          for (ndx = 0; ndx < (unsigned int)nwritten; ndx++)
            {
              if (++uartdev->xmit.tail >= uartdev->xmit.size)
                {
                  uartdev->xmit.tail = 0;
                }
            }
          uart_spinunlock(uartdev, false, flags);
          uart_datasent(uartdev);
        }
      else if (nwritten < 0 && nwritten != -EAGAIN &&
               nwritten != -ESHUTDOWN && !priv->disconnected)
        {
          uerr("CH34x TX transfer failed: %d\n", (int)nwritten);
        }
    }

