open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_usbserial_ch34x.c
  bk7258_ch34x_queue_tx(priv, BK7258_CH34X_XFERDELAY);
}

#ifdef CONFIG_BK7258_USBHOST_CH34X_VALIDATION
static int bk7258_ch34x_validation_thread(int argc, FAR char *argv[])
{
  static const uint8_t pattern[] = "BK7258-CH34X-LOOP";
  uint8_t received[sizeof(pattern) - 1];
  struct pollfd pfd;
  size_t offset = 0;
  ssize_t nbytes;
  int fd;
  int ret;

  (void)argc;
  (void)argv;
  nxsig_usleep(300 * 1000);

  fd = open(BK7258_CH34X_DEVNAME, O_RDWR | O_NONBLOCK);
  if (fd < 0)
    {
      syslog(LOG_ERR, "bk7258-ch34x: open failed: %d\n", errno);
      return -errno;
    }

  nbytes = write(fd, pattern, sizeof(pattern) - 1);
  if (nbytes != sizeof(pattern) - 1)
    {
      syslog(LOG_ERR, "bk7258-ch34x: TX failed: %d/%ld\n",
             errno, (long)nbytes);
      close(fd);
      return nbytes < 0 ? -errno : -EIO;
    }

  syslog(LOG_INFO, "bk7258-ch34x: TX PASS bytes=%u\n",
         (unsigned int)(sizeof(pattern) - 1));

  pfd.fd = fd;
  pfd.events = POLLIN;
  while (offset < sizeof(received))
    {
      pfd.revents = 0;
      ret = poll(&pfd, 1, 10000);
      if (ret <= 0)
        {
          syslog(LOG_ERR, "bk7258-ch34x: RX timeout/error: %d\n",
                 ret < 0 ? errno : ETIMEDOUT);
          close(fd);
          return ret < 0 ? -errno : -ETIMEDOUT;
        }

      nbytes = read(fd, received + offset, sizeof(received) - offset);
      if (nbytes < 0)
        {
          if (errno == EAGAIN)
            {
              continue;
            }

          syslog(LOG_ERR, "bk7258-ch34x: RX failed: %d\n", errno);
          close(fd);
          return -errno;
        }

      offset += nbytes;
    }

  close(fd);
  if (memcmp(pattern, received, sizeof(received)) != 0)
    {
      syslog(LOG_ERR, "bk7258-ch34x: loopback mismatch\n");
      return -EIO;
    }

  syslog(LOG_INFO, "bk7258-ch34x: LOOPBACK PASS bytes=%u\n",
         (unsigned int)sizeof(received));
  return OK;
}
#endif

static FAR struct usbhost_class_s *bk7258_ch34x_create(
  FAR struct usbhost_hubport_s *hport,
  FAR const struct usbhost_id_s *id)
{
  FAR struct bk7258_usbserial_ch34x_s *priv = &g_bk7258_ch34x;
  irqstate_t flags;

  (void)id;
  if (hport == NULL || hport->drvr == NULL)
    {
      return NULL;
    }

  flags = spin_lock_irqsave(&g_bk7258_ch34x_alloc_lock);
  if (g_bk7258_ch34x_inuse)
    {
      spin_unlock_irqrestore(&g_bk7258_ch34x_alloc_lock, flags);
      return NULL;
    }

  g_bk7258_ch34x_inuse = true;
  spin_unlock_irqrestore(&g_bk7258_ch34x_alloc_lock, flags);

  memset(priv, 0, sizeof(*priv));
  nxmutex_init(&priv->lock);
  spin_lock_init(&priv->rxlock);
  priv->usbclass.hport = hport;
  priv->usbclass.connect = bk7258_ch34x_connect;
  priv->usbclass.disconnected = bk7258_ch34x_disconnected;
  priv->crefs = 1;
  priv->lcr = BK7258_CH34X_LCR_ENABLE_RX |
             BK7258_CH34X_LCR_ENABLE_TX |
             BK7258_CH34X_LCR_CS8;
  priv->mcr = BK7258_CH34X_BIT_RTS | BK7258_CH34X_BIT_DTR;

  priv->uartdev.recv.size = sizeof(priv->rxbuffer);
  priv->uartdev.recv.buffer = priv->rxbuffer;
  priv->uartdev.xmit.size = sizeof(priv->txbuffer);
  priv->uartdev.xmit.buffer = priv->txbuffer;
  priv->uartdev.ops = &g_bk7258_ch34x_uart_ops;
  priv->uartdev.priv = priv;
  return &priv->usbclass;
}

static int bk7258_ch34x_connect(FAR struct usbhost_class_s *usbclass,
  FAR const uint8_t *configdesc, int desclen)
{
  FAR struct bk7258_usbserial_ch34x_s *priv =
    (FAR struct bk7258_usbserial_ch34x_s *)usbclass;
  bool destroy = false;
  irqstate_t flags;
  int ret;

  if (priv == NULL || configdesc == NULL)
    {
      return -EINVAL;
    }

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  flags = spin_lock_irqsave(&g_bk7258_ch34x_alloc_lock);
  priv->crefs++;
  spin_unlock_irqrestore(&g_bk7258_ch34x_alloc_lock, flags);
  ret = bk7258_ch34x_cfgdesc(priv, configdesc, desclen);
  if (ret < 0)
    {
      uerr("CH34x descriptor/endpoint setup failed: %d\n", ret);
    }

  if (ret >= 0)
    {
      ret = bk7258_ch34x_alloc_buffers(priv);
      if (ret < 0)
        {
          uerr("CH34x transfer-buffer allocation failed: %d\n", ret);
        }
    }
  if (ret >= 0)
    {
      ret = bk7258_ch34x_configure(priv);
      if (ret < 0)
        {
          uerr("CH34x device configuration failed: %d\n", ret);
        }
    }
  if (ret >= 0)
    {
      flags = spin_lock_irqsave(&g_bk7258_ch34x_alloc_lock);
      if (priv->disconnected)
        {
          ret = -ENODEV;
        }
      spin_unlock_irqrestore(&g_bk7258_ch34x_alloc_lock, flags);

      if (ret >= 0)
        {
          ret = uart_register(BK7258_CH34X_DEVNAME, &priv->uartdev);
          if (ret < 0)
            {
              uerr("CH34x UART registration failed: %d\n", ret);
            }

          if (ret >= 0)
            {
              priv->registered = true;
              uinfo("Registered %s (CH34x version 0x%02x)\n",
                    BK7258_CH34X_DEVNAME, priv->version);
#ifdef CONFIG_SERIAL_REMOVABLE
              uart_connected(&priv->uartdev, true);
#endif
#ifdef CONFIG_BK7258_USBHOST_CH34X_VALIDATION
              ret = kthread_create("bk7258-ch34x", SCHED_PRIORITY_DEFAULT,
                                   2048, bk7258_ch34x_validation_thread,
                                   NULL);
              if (ret < 0)
                {
                  uerr("CH34x validation worker failed: %d\n", ret);
                }
              else
                {
                  ret = OK;
                }
#endif
            }
        }
    }

  flags = spin_lock_irqsave(&g_bk7258_ch34x_alloc_lock);
  priv->crefs--;
  destroy = priv->disconnected && priv->crefs == 1;
  spin_unlock_irqrestore(&g_bk7258_ch34x_alloc_lock, flags);
  nxmutex_unlock(&priv->lock);

  /* A disconnect can race the non-ISR connect callback.  The USB host has
   * already delivered disconnected() in this case, so the final connect
   * reference owns the cleanup rather than waiting for a second callback. */

  if (destroy)
    {
      bk7258_ch34x_destroy(priv);
    }

  return ret;
}

