open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_usbserial_ch34x.c
static int bk7258_ch34x_disconnected(FAR struct usbhost_class_s *usbclass)
{
  FAR struct bk7258_usbserial_ch34x_s *priv =
    (FAR struct bk7258_usbserial_ch34x_s *)usbclass;
  FAR struct usbhost_hubport_s *hport;
  bool destroy = false;
  int16_t crefs;

  DEBUGASSERT(priv != NULL && priv->usbclass.hport != NULL);
  hport = priv->usbclass.hport;
  irqstate_t rxflags = spin_lock_irqsave(&priv->rxlock);
  priv->disconnected = true;
  priv->rxena = false;
  spin_unlock_irqrestore(&priv->rxlock, rxflags);
  priv->txena = false;
#ifdef CONFIG_SERIAL_REMOVABLE
  if (priv->registered)
    {
      uart_connected(&priv->uartdev, false);
    }
#endif

  work_cancel(LPWORK, &priv->rxwork);
  work_cancel(LPWORK, &priv->rxcompletework);
  work_cancel(LPWORK, &priv->txwork);
  if (priv->bulkin != NULL)
    {
      (void)DRVR_CANCEL(hport->drvr, priv->bulkin);
    }
  if (priv->bulkout != NULL)
    {
      (void)DRVR_CANCEL(hport->drvr, priv->bulkout);
    }

  irqstate_t flags = spin_lock_irqsave(&g_bk7258_ch34x_alloc_lock);
  crefs = priv->crefs;
  spin_unlock_irqrestore(&g_bk7258_ch34x_alloc_lock, flags);
  if (crefs == 1)
    {
      destroy = true;
    }

  if (destroy)
    {
      if (up_interrupt_context())
        {
          int ret = work_queue(HPWORK, &priv->destroywork,
                               bk7258_ch34x_destroy, priv, 0);
          DEBUGASSERT(ret >= 0);
          (void)ret;
        }
      else
        {
          bk7258_ch34x_destroy(priv);
        }
    }

  return OK;
}

static void bk7258_ch34x_destroy(FAR void *arg)
{
  FAR struct bk7258_usbserial_ch34x_s *priv = arg;
  FAR struct usbhost_hubport_s *hport;

  DEBUGASSERT(priv != NULL && priv->usbclass.hport != NULL);
  hport = priv->usbclass.hport;
  work_cancel_sync(LPWORK, &priv->rxwork);
  work_cancel_sync(LPWORK, &priv->rxcompletework);
  work_cancel_sync(LPWORK, &priv->txwork);

  /* DRVR_CANCEL completes the outstanding asynchronous callback before it
   * returns.  The work cancellations above then guarantee that no worker can
   * still inspect the result or inbuf before those buffers are freed.  The
   * disconnect callback normally performs this cancellation first; repeat it
   * here so every destroy path owns the same endpoint lifetime guarantee. */

  if (priv->bulkin != NULL)
    {
      (void)DRVR_CANCEL(hport->drvr, priv->bulkin);
    }

  irqstate_t rxflags = spin_lock_irqsave(&priv->rxlock);
  priv->rx_active = false;
  priv->rx_pending = false;
  priv->rx_working = false;
  spin_unlock_irqrestore(&priv->rxlock, rxflags);

  if (priv->registered)
    {
      unregister_driver(BK7258_CH34X_DEVNAME);
      priv->registered = false;
    }
  if (priv->endpoints)
    {
      DRVR_EPFREE(hport->drvr, priv->bulkin);
      DRVR_EPFREE(hport->drvr, priv->bulkout);
      priv->bulkin = NULL;
      priv->bulkout = NULL;
      priv->endpoints = false;
    }
  bk7258_ch34x_free_buffers(priv);
  nxmutex_destroy(&priv->lock);
  DRVR_DISCONNECT(hport->drvr, hport);

  irqstate_t flags = spin_lock_irqsave(&g_bk7258_ch34x_alloc_lock);
  g_bk7258_ch34x_inuse = false;
  spin_unlock_irqrestore(&g_bk7258_ch34x_alloc_lock, flags);
}

static int bk7258_ch34x_setup(FAR struct uart_dev_s *uartdev)
{
  FAR struct bk7258_usbserial_ch34x_s *priv =
    bk7258_ch34x_from_uart(uartdev);
  irqstate_t flags;
  int ret;

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  flags = spin_lock_irqsave(&g_bk7258_ch34x_alloc_lock);
  if (priv->disconnected)
    {
      ret = -ENODEV;
    }
  else
    {
      priv->crefs++;
      ret = OK;
    }
  spin_unlock_irqrestore(&g_bk7258_ch34x_alloc_lock, flags);
  nxmutex_unlock(&priv->lock);
  return ret;
}

static void bk7258_ch34x_shutdown(FAR struct uart_dev_s *uartdev)
{
  FAR struct bk7258_usbserial_ch34x_s *priv =
    bk7258_ch34x_from_uart(uartdev);
  irqstate_t flags;
  bool destroy;

  nxmutex_lock(&priv->lock);
  flags = spin_lock_irqsave(&g_bk7258_ch34x_alloc_lock);
  if (priv->crefs > 1)
    {
      priv->crefs--;
    }
  destroy = priv->disconnected && priv->crefs == 1;
  spin_unlock_irqrestore(&g_bk7258_ch34x_alloc_lock, flags);
  nxmutex_unlock(&priv->lock);

  if (destroy)
    {
      bk7258_ch34x_destroy(priv);
    }
}

static int bk7258_ch34x_attach(FAR struct uart_dev_s *uartdev)
{
  (void)uartdev;
  return OK;
}

static void bk7258_ch34x_detach(FAR struct uart_dev_s *uartdev)
{
  (void)uartdev;
}

static int bk7258_ch34x_ioctl(FAR struct file *filep, int cmd,
                              unsigned long arg)
{
  FAR struct uart_dev_s *uartdev = filep->f_inode->i_private;
  FAR struct bk7258_usbserial_ch34x_s *priv =
    bk7258_ch34x_from_uart(uartdev);
  FAR struct termios *termiosp = (FAR struct termios *)arg;
  int ret;

  if (priv->disconnected)
    {
      return -ENODEV;
    }

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  switch (cmd)
    {
#ifdef CONFIG_SERIAL_TERMIOS
      case TCGETS:
        if (termiosp == NULL)
          {
            ret = -EINVAL;
            break;
          }

        cfsetispeed(termiosp, 115200);
        cfsetospeed(termiosp, 115200);
        termiosp->c_cflag = CS8;
        ret = OK;
        break;

      case TCSETS:
        if (termiosp == NULL)
          {
            ret = -EINVAL;
            break;
          }

        if (cfgetispeed(termiosp) != 115200 ||
            cfgetospeed(termiosp) != 115200 ||
            (termiosp->c_cflag & (CSIZE | PARENB | PARODD | CSTOPB |
                                  CRTSCTS)) != CS8 ||
            (termiosp->c_iflag & (IXON | IXOFF)) != 0)
          {
            ret = -ENOTSUP;
            break;
          }

        ret = OK;
        break;
#endif

      default:
        ret = -ENOTTY;
        break;
    }

  nxmutex_unlock(&priv->lock);
  return ret;
}

static void bk7258_ch34x_rxint(FAR struct uart_dev_s *uartdev, bool enable)
{
  FAR struct bk7258_usbserial_ch34x_s *priv =
    bk7258_ch34x_from_uart(uartdev);
  irqstate_t flags = spin_lock_irqsave(&priv->rxlock);

