open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_usbserial_ch34x.c
  priv->rxena = enable && !priv->disconnected;
  if (!enable)
    {
      priv->rx_pending = false;
    }
  spin_unlock_irqrestore(&priv->rxlock, flags);
  if (enable)
    {
      bk7258_ch34x_queue_rx(priv, 0);
    }
  else
    {
      work_cancel(LPWORK, &priv->rxwork);
      work_cancel(LPWORK, &priv->rxcompletework);
    }
}

static bool bk7258_ch34x_rxavailable(FAR struct uart_dev_s *uartdev)
{
  irqstate_t flags;
  bool available;

  flags = uart_spinlock(uartdev, false);
  available = uartdev->recv.head != uartdev->recv.tail;
  uart_spinunlock(uartdev, false, flags);
  return available;
}

static void bk7258_ch34x_txint(FAR struct uart_dev_s *uartdev, bool enable)
{
  FAR struct bk7258_usbserial_ch34x_s *priv =
    bk7258_ch34x_from_uart(uartdev);
  irqstate_t flags = spin_lock_irqsave(&g_bk7258_ch34x_alloc_lock);

  priv->txena = enable && !priv->disconnected;
  spin_unlock_irqrestore(&g_bk7258_ch34x_alloc_lock, flags);
  if (enable)
    {
      bk7258_ch34x_queue_tx(priv, 0);
    }
  else
    {
      work_cancel(LPWORK, &priv->txwork);
    }
}

static bool bk7258_ch34x_txready(FAR struct uart_dev_s *uartdev)
{
  irqstate_t flags;
  unsigned int next;
  bool ready;

  flags = uart_spinlock(uartdev, false);
  next = uartdev->xmit.head + 1;
  if (next >= (unsigned int)uartdev->xmit.size)
    {
      next = 0;
    }
  ready = next != (unsigned int)uartdev->xmit.tail;
  uart_spinunlock(uartdev, false, flags);
  return ready;
}

static bool bk7258_ch34x_txempty(FAR struct uart_dev_s *uartdev)
{
  irqstate_t flags;
  bool empty;

  flags = uart_spinlock(uartdev, false);
  empty = uartdev->xmit.head == uartdev->xmit.tail;
  uart_spinunlock(uartdev, false, flags);
  return empty;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

int bk7258_usbserial_ch34x_initialize(void)
{
  int ret = OK;

  ret = nxmutex_lock(&g_bk7258_ch34x_registry_lock);
  if (ret < 0)
    {
      return ret;
    }

  if (!g_bk7258_ch34x_registered)
    {
      ret = usbhost_registerclass(&g_bk7258_ch34x_registry);
      if (ret >= 0)
        {
          g_bk7258_ch34x_registered = true;
        }
    }

  nxmutex_unlock(&g_bk7258_ch34x_registry_lock);
  return ret;
}
